RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_DCDC.h
/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- DCDC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DCDC_Peripheral_Access_Layer DCDC Peripheral Access Layer
 * @{
 */

/** DCDC - Register Layout Typedef */
typedef struct {
  __IO uint32_t CTRL0;                             /**< DCDC Control Register 0, offset: 0x0 */
  __IO uint32_t CTRL1;                             /**< DCDC Control Register 1, offset: 0x4 */
  __IO uint32_t REG0;                              /**< DCDC Register 0, offset: 0x8 */
  __IO uint32_t REG1;                              /**< DCDC Register 1, offset: 0xC */
  __IO uint32_t REG2;                              /**< DCDC Register 2, offset: 0x10 */
  __IO uint32_t REG3;                              /**< DCDC Register 3, offset: 0x14 */
  __IO uint32_t REG4;                              /**< DCDC Register 4, offset: 0x18 */
  __IO uint32_t REG5;                              /**< DCDC Register 5, offset: 0x1C */
  __IO uint32_t REG6;                              /**< DCDC Register 6, offset: 0x20 */
  __IO uint32_t REG7;                              /**< DCDC Register 7, offset: 0x24 */
  __IO uint32_t REG7P;                             /**< DCDC Register 7 plus, offset: 0x28 */
  __IO uint32_t REG8;                              /**< DCDC Register 8, offset: 0x2C */
  __IO uint32_t REG9;                              /**< DCDC Register 9, offset: 0x30 */
  __IO uint32_t REG10;                             /**< DCDC Register 10, offset: 0x34 */
  __IO uint32_t REG11;                             /**< DCDC Register 11, offset: 0x38 */
  __IO uint32_t REG12;                             /**< DCDC Register 12, offset: 0x3C */
  __IO uint32_t REG13;                             /**< DCDC Register 13, offset: 0x40 */
  __IO uint32_t REG14;                             /**< DCDC Register 14, offset: 0x44 */
  __IO uint32_t REG15;                             /**< DCDC Register 15, offset: 0x48 */
  __IO uint32_t REG16;                             /**< DCDC Register 16, offset: 0x4C */
  __IO uint32_t REG17;                             /**< DCDC Register 17, offset: 0x50 */
  __IO uint32_t REG18;                             /**< DCDC Register 18, offset: 0x54 */
  __IO uint32_t REG19;                             /**< DCDC Register 19, offset: 0x58 */
  __IO uint32_t REG20;                             /**< DCDC Register 20, offset: 0x5C */
  __IO uint32_t REG21;                             /**< DCDC Register 21, offset: 0x60 */
  __IO uint32_t REG22;                             /**< DCDC Register 22, offset: 0x64 */
  __IO uint32_t REG23;                             /**< DCDC Register 23, offset: 0x68 */
  __IO uint32_t REG24;                             /**< DCDC Register 24, offset: 0x6C */
} DCDC_Type;

/* ----------------------------------------------------------------------------
   -- DCDC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DCDC_Register_Masks DCDC Register Masks
 * @{
 */

/*! @name CTRL0 - DCDC Control Register 0 */
/*! @{ */

#define DCDC_CTRL0_ENABLE_MASK                   (0x1U)
#define DCDC_CTRL0_ENABLE_SHIFT                  (0U)
/*! ENABLE
 *  0b0..Disable (Bypass)
 *  0b1..Enable
 */
#define DCDC_CTRL0_ENABLE(x)                     (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_ENABLE_SHIFT)) & DCDC_CTRL0_ENABLE_MASK)

#define DCDC_CTRL0_DIG_EN_MASK                   (0x2U)
#define DCDC_CTRL0_DIG_EN_SHIFT                  (1U)
/*! DIG_EN
 *  0b0..Reserved
 *  0b1..Enable
 */
#define DCDC_CTRL0_DIG_EN(x)                     (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_DIG_EN_SHIFT)) & DCDC_CTRL0_DIG_EN_MASK)

#define DCDC_CTRL0_STBY_EN_MASK                  (0x4U)
#define DCDC_CTRL0_STBY_EN_SHIFT                 (2U)
/*! STBY_EN
 *  0b1..Enter into standby mode
 */
#define DCDC_CTRL0_STBY_EN(x)                    (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_STBY_EN_SHIFT)) & DCDC_CTRL0_STBY_EN_MASK)

#define DCDC_CTRL0_LP_MODE_EN_MASK               (0x8U)
#define DCDC_CTRL0_LP_MODE_EN_SHIFT              (3U)
/*! LP_MODE_EN
 *  0b1..Enter into low-power mode
 */
#define DCDC_CTRL0_LP_MODE_EN(x)                 (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_LP_MODE_EN_SHIFT)) & DCDC_CTRL0_LP_MODE_EN_MASK)

#define DCDC_CTRL0_STBY_LP_MODE_EN_MASK          (0x10U)
#define DCDC_CTRL0_STBY_LP_MODE_EN_SHIFT         (4U)
/*! STBY_LP_MODE_EN
 *  0b0..Disable DCDC entry into low-power mode from a GPC standby request
 *  0b1..Enable DCDC to enter into low-power mode from a GPC standby request
 */
#define DCDC_CTRL0_STBY_LP_MODE_EN(x)            (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_STBY_LP_MODE_EN_SHIFT)) & DCDC_CTRL0_STBY_LP_MODE_EN_MASK)

#define DCDC_CTRL0_ENABLE_DCDC_CNT_MASK          (0x20U)
#define DCDC_CTRL0_ENABLE_DCDC_CNT_SHIFT         (5U)
/*! ENABLE_DCDC_CNT - Enable internal count for DCDC_OK timeout
 *  0b0..Wait DCDC_OK for ACK
 *  0b1..Enable internal count for DCDC_OK timeout
 */
#define DCDC_CTRL0_ENABLE_DCDC_CNT(x)            (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_ENABLE_DCDC_CNT_SHIFT)) & DCDC_CTRL0_ENABLE_DCDC_CNT_MASK)

#define DCDC_CTRL0_TRIM_HOLD_MASK                (0x40U)
#define DCDC_CTRL0_TRIM_HOLD_SHIFT               (6U)
/*! TRIM_HOLD - Hold trim input
 *  0b0..Sample trim input
 *  0b1..Hold trim input
 */
#define DCDC_CTRL0_TRIM_HOLD(x)                  (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_TRIM_HOLD_SHIFT)) & DCDC_CTRL0_TRIM_HOLD_MASK)

#define DCDC_CTRL0_DEBUG_BITS_MASK               (0x7FF80000U)
#define DCDC_CTRL0_DEBUG_BITS_SHIFT              (19U)
/*! DEBUG_BITS - DEBUG_BITS[11:0] */
#define DCDC_CTRL0_DEBUG_BITS(x)                 (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_DEBUG_BITS_SHIFT)) & DCDC_CTRL0_DEBUG_BITS_MASK)

#define DCDC_CTRL0_CONTROL_MODE_MASK             (0x80000000U)
#define DCDC_CTRL0_CONTROL_MODE_SHIFT            (31U)
/*! CONTROL_MODE - Control mode
 *  0b0..Software control mode
 *  0b1..Hardware control mode (controlled by GPC Setpoints)
 */
#define DCDC_CTRL0_CONTROL_MODE(x)               (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_CONTROL_MODE_SHIFT)) & DCDC_CTRL0_CONTROL_MODE_MASK)
/*! @} */

/*! @name CTRL1 - DCDC Control Register 1 */
/*! @{ */

#define DCDC_CTRL1_VDD1P8CTRL_TRG_MASK           (0x1FU)
#define DCDC_CTRL1_VDD1P8CTRL_TRG_SHIFT          (0U)
/*! VDD1P8CTRL_TRG
 *  0b00000..1.5V
 *  0b01100..1.8V
 *  0b11111..2.275V
 */
#define DCDC_CTRL1_VDD1P8CTRL_TRG(x)             (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL1_VDD1P8CTRL_TRG_SHIFT)) & DCDC_CTRL1_VDD1P8CTRL_TRG_MASK)

